In [1]:
import numpy as np
import pandas as pd
import matplotlib
from matplotlib import pyplot as plt

In [2]:
df=pd.read_csv('Bengaluru_House_Data.csv')

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [5]:
df.shape

(13320, 9)

In [6]:
df1=df.drop(['area_type','availability','society'],axis='columns')

In [7]:
df1.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [8]:
df1.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [9]:
df1['balcony'].fillna((df1['balcony'].mean()), inplace=True)
df1['bath'].fillna((df1['bath'].mean()), inplace=True)

In [10]:
df1.isnull().sum()

location       1
size          16
total_sqft     0
bath           0
balcony        0
price          0
dtype: int64

In [11]:
df2=df1.dropna()
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [12]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [13]:
df2['bhk']=df2['size'].apply(lambda x:int(x.split(' ')[0]))

<ipython-input-13-c09742ede0b1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['bhk']=df2['size'].apply(lambda x:int(x.split(' ')[0]))

In [14]:
df2.head()

                   location       size total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00    2

In [15]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [16]:
df2[~df2['total_sqft'].apply(is_float)].head(10)

,location,size,total_sqft,bath,balcony,price,bhk
30,Yelahanka,4 BHK,2100 - 2850,4.00000,0.000000,186.000,4
56,Devanahalli,4 Bedroom,3010 - 3410,2.69261,1.584376,192.000,4
81,Hennur Road,4 Bedroom,2957 - 3450,2.69261,1.584376,224.500,4
122,Hebbal,4 BHK,3067 - 8156,4.00000,0.000000,477.000,4
137,8th Phase JP Nagar,2 BHK,1042 - 1105,2.00000,0.000000,54.005,2
165,Sarjapur,2 BHK,1145 - 1340,2.00000,0.000000,43.490,2
188,KR Puram,2 BHK,1015 - 1540,2.00000,0.000000,56.800,2
224,Devanahalli,3 BHK,1520 - 1740,2.69261,1.584376,74.820,3
410,Kengeri,1 BHK,34.46Sq. Meter,1.00000,0.000000,18.500,1
549,Hennur Road,2 BHK,1195 - 1440,2.00000,0.000000,63.770,2

In [17]:
#Above shows that total_sqft can be a range (e.g. 2100-2850). For such case we can just take average of min and max value in the range.
#There are other cases such as 34.46Sq. Meter which one can convert to square ft using unit conversion. I am going to just drop such corner cases to keep things simple
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [18]:
df3 = df2.copy()
df3.total_sqft = df3.total_sqft.apply(convert_sqft_to_num)
df3 = df3[df3.total_sqft.notnull()]
df3.head(5)

                   location       size  total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0      1.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0      1.0   51.00    2

In [19]:
df3.loc[122]

location      Hebbal
size           4 BHK
total_sqft    5611.5
bath             4.0
balcony          0.0
price          477.0
bhk                4
Name: 122, dtype: object

In [20]:
#adding price per sq/ft column
df3['price_per_sqft'] = df3['price']*100000/df3['total_sqft']
df3.head()

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,1.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,1.0,51.00,2,4250.000000

In [21]:
df3['price_per_sqft'].describe()

count    1.325700e+04
mean     7.912825e+03
std      1.064976e+05
min      2.678298e+02
25%      4.271186e+03
50%      5.438596e+03
75%      7.313318e+03
max      1.200000e+07
Name: price_per_sqft, dtype: float64

In [23]:
len(df3['location'].unique())

1287

In [22]:
#Examine locations which is a categorical variable. 
#We will apply dimensionality reduction technique here to reduce number of locations

df3.location = df3.location.apply(lambda x: x.strip())
location_stats = df3['location'].value_counts(ascending=False)
location_stats

Whitefield               538
Sarjapur  Road           397
Electronic City          304
Kanakpura Road           271
Thanisandra              236
                        ...
Hanuman Nagar              1
Vinayaka Layout            1
Jay an agar 4 T Block      1
T K Reddy Layout           1
Sector 4 HSR Layout        1
Name: location, Length: 1287, dtype: int64

In [24]:
location_stats.values.sum()

13257

In [25]:
len(location_stats[location_stats>10])

240

In [26]:
len(location_stats[location_stats<10])

1033

In [27]:
#Any location having less than 10 data points should be tagged as "other" location. 
#This way number of categories can be reduced by huge amount. 
#Later on when we do one hot encoding, it will help us with having fewer dummy columns
location_stats_less_than_10 = location_stats[location_stats<=10]
location_stats_less_than_10

Nagadevanahalli          10
Kalkere                  10
Dodsworth Layout         10
Sector 1 HSR Layout      10
Gunjur Palya             10
                         ..
Hanuman Nagar             1
Vinayaka Layout           1
Jay an agar 4 T Block     1
T K Reddy Layout          1
Sector 4 HSR Layout       1
Name: location, Length: 1047, dtype: int64

In [29]:
df3.location = df3.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)
len(df3.location.unique())

241

In [30]:
df3.head(10)

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,1.000000,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.000000,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,3.000000,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,1.000000,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,1.000000,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,1.000000,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,1.584376,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,1.584376,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,1.000000,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,1.584376,370.00,6,36274.509804

In [33]:
df3[df3.total_sqft/df3.bhk<300].head()

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
9,other,6 Bedroom,1020.0,6.0,1.584376,370.0,6,36274.509804
45,HSR Layout,8 Bedroom,600.0,9.0,1.584376,200.0,8,33333.333333
58,Murugeshpalya,6 Bedroom,1407.0,4.0,1.000000,150.0,6,10660.980810
68,Devarachikkanahalli,8 Bedroom,1350.0,7.0,0.000000,85.0,8,6296.296296
70,other,3 Bedroom,500.0,3.0,2.000000,100.0,3,20000.000000

In [36]:
df4=df3[~(df3.total_sqft/df3.bhk<300)]
df4.shape

(12513, 8)

In [37]:
#Outlier Removal Using Standard Deviation and Mean
df4.price_per_sqft.describe()

count     12513.000000
mean       6307.441644
std        4160.931610
min         267.829813
25%        4210.526316
50%        5295.007564
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [38]:
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_out = pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out
df5 = remove_pps_outliers(df4)
df5.shape

(10288, 8)